app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 6]]
---
  def show
    @article = Article.find(params[:id])
    # @comment = @article.comments.new
    @comment = Comment.new
    @comment.article_id = @article.id
    @count = @article.comments.length

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 4]]
---
  def destroy
    # fail
    @article = Article.find(params[:id])
    @article.destroy